---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.EndConnectorIndex
source: html/aac67e76-0a42-1d5a-708b-232266e83084.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.EndConnectorIndex Property

The index of the end conector of the flow path

## Syntax (C#)
```csharp
public int EndConnectorIndex { get; }
```